{
    "cards": {
        "1": {
            "title": "¿Qué es esta página?",
            "subTitle": "Presentación",
            "content": "Bienvenido a mi página web personal. Este espacio está diseñado para presentarme profesionalmente, mostrar mis habilidades como desarrollador y ofrecerte una experiencia interactiva para que conozcas lo que puedo crear."
        },
        "2": {
            "title": "¿Quién soy?",
            "subTitle": "Sobre mí",
            "content": "Mi nombre es Brayan Vidal Romero y soy un desarrollador full stack con experiencia en la creación de aplicaciones web completas, desde la base de datos hasta la interfaz de usuario."
        },
        "3": {
            "title": "¿Qué hago?",
            "subTitle": "Habilidades",
            "content": "Me dedico al desarrollo de software utilizando tecnologías como JavaScript, TypeScript, React, Node, Express, PostgreSQL, MongoDB, MySQL y más."
        },
        "4": {
            "title": "¿Cuál es el objetivo?",
            "subTitle": "Propósito",
            "content": "Esta página tiene como objetivo mostrar una parte de mi trabajo y habilidades. Aquí puedes interactuar con diferentes componentes y explorar ejemplos de lo que puedo construir."
        },
        "5": {
            "title": "¿Necesitas una web?",
            "subTitle": "Para clientes",
            "content": "Si tienes una idea, un emprendimiento o necesitas mejorar tu presencia online, puedo ayudarte a crear una solución web profesional, moderna y personalizada. Trabajo de forma cercana con mis clientes para transformar sus necesidades en productos funcionales y atractivos."
        },
        "6": {
            "title": "¡Explora y disfruta!",
            "subTitle": "Interactividad",
            "content": "Esta página está pensada para que no solo leas sobre mí, sino que también interactúes. Puedes cambiar los colores del sitio creando tu propia paleta personalizada, modificar una tabla (agregar, editar y eliminar información) y acceder fácilmente a mis redes sociales para contactarme."
        }
    }
}